#include <stdio.h>

int main()
{
    int a[5], i, soma = 0;
    printf("\n------------------------------------SOMA-------------------------------------------\n\n");
    printf("Digite os números: ");
    for (i = 0; i < 5; i++)
    {
        scanf("%d", &a[i]);
        soma += a[i];
    }
    printf("\n--------------------------------------------------------------------------------------\n\n");
    printf("A soma de todos os números do vetor é: %d ", soma);
    printf("\n\n--------------------------------------------------------------------------------------\n\n");

    return 0;
}